{ "date" : {
    "title": "Manner of Spirit",
    "scripture": "But He turned and rebuked them, and said, “You do not know what manner of spirit you are of. (Luke 9:55)",
    "body": "Jesus Christ is not a conservative, moderate, or liberal. He is not an American, nor is He limited to or by any nationality. He is God Almighty, who cannot be contained in any of the principles, theologies, doctrines, or systems we construct. In fact, Jesus did not come to give us Christian principles or convictions, but to give us abundant life -- and this life does not flow from laws and rules, but from His Holy Spirit. He simply won't fit into our politics, our religion, our buildings, denominations, or programs -- and certainly not our principles or convictions (no matter how sincere). Beware of the temptation to mistake your passionate beliefs for His. His ways, His thoughts, and His words are higher than ours, and that will never change. The Word of God is the only defense we have against our tendency to create our own god and our own spiritual narrative. That's what the writer of Hebrews means here when he says, For the word of God is living and powerful, and sharper than any two-edged sword, piercing even to the division of soul and spirit, and of joints and marrow, and is a discerner of the thoughts and intents of the heart. (Hebrews 4:12) God's Word alone gets to the true heart and spirit of every issue; and if we are to get to the truth, we must get there by His Word. We sometimes do not know what manner of spirit we are of, because we have strayed from the Bible. This is a trap that so many have fallen into in this religious age, and it has resulted in the perverted form of godliness we too often witness. We are consumed with our own good works, possessing none of the raw power of the Gospel of Jesus Christ (that is why Christians are known by everything except love). If Satan can get us a few degrees off the center of God's word, he has succeeded in robbing us of the fullness of God in Christ. Unfortunately, he has been far too successful in doing so. May the Lord open our hearts and eyes to the scriptures, and may He pour out His Spirit upon us afresh and anew. Amen. Let’s Pray – Father, forgive us for making things about us, and not about Jesus. We need Your Holy Spirit, if we are to have abundant life. Refresh and renew us today! In Jesus, Amen." }
    }
